tests/mutation_set/M05_start_time_precedence_swap.patch
diff --git a/custom_components/adaptive_cover/coordinator.py b/custom_components/adaptive_cover/coordinator.py
--- a/custom_components/adaptive_cover/coordinator.py
+++ b/custom_components/adaptive_cover/coordinator.py
@@ -1406,6 +1406,16 @@
     def after_start_time(self):
         """Check if time is after start time."""
         now = self._now_local()
+        if self.start_time is not None:
+            time = get_datetime_from_str(
+                self.start_time, default_date=now.date()
+            )
+
+            self.logger.debug(
+                "Start time: %s, now: %s, now >= time: %s", time, now, now >= time
+            )
+            self._start_time
+            return now >= time
         if self.start_time_entity is not None:
             time = get_datetime_from_str(
                 get_safe_state(self.hass, self.start_time_entity),
@@ -1415,16 +1425,6 @@
                 "Start time: %s, now: %s, now >= time: %s ", time, now, now >= time
             )
             self._start_time = time
-            return now >= time
-        if self.start_time is not None:
-            time = get_datetime_from_str(
-                self.start_time, default_date=now.date()
-            )
-
-            self.logger.debug(
-                "Start time: %s, now: %s, now >= time: %s", time, now, now >= time
-            )
-            self._start_time
             return now >= time
         return True
 
