tests/mutation_set/M12_override_duration_minutes_to_hours.patch
diff --git a/custom_components/adaptive_cover/coordinator.py b/custom_components/adaptive_cover/coordinator.py
--- a/custom_components/adaptive_cover/coordinator.py
+++ b/custom_components/adaptive_cover/coordinator.py
@@ -1315,7 +1315,7 @@
         self.max_moves_hour = options.get(CONF_MAX_MOVES_HOUR)
 
     def _update_manager_and_covers(self):
-        self.manager.reset_duration = dt.timedelta(**self.manual_duration)
+        self.manager.reset_duration = dt.timedelta(**self.manual_duration) * 60
         self.logger.debug(
             "Manual override duration from config: %s → timedelta: %s",
             self.manual_duration,
