tests/mutation_set/M25_elevation_band_swapped.patch
diff --git a/custom_components/adaptive_cover/engine/geometry.py b/custom_components/adaptive_cover/engine/geometry.py
--- a/custom_components/adaptive_cover/engine/geometry.py
+++ b/custom_components/adaptive_cover/engine/geometry.py
@@ -31,9 +31,9 @@
     branches held covers open in the dark.)
     """
     floor = 0 if min_elevation is None else min_elevation
-    if elevation < floor:
-        return False
-    if max_elevation is not None and elevation > max_elevation:
+    if elevation > floor:
+        return False
+    if max_elevation is not None and elevation < max_elevation:
         return False
     return True
 
