tests/mutation_set/M36_interp_xp_fp_swap.patch
diff --git a/custom_components/adaptive_cover/coordinator.py b/custom_components/adaptive_cover/coordinator.py
--- a/custom_components/adaptive_cover/coordinator.py
+++ b/custom_components/adaptive_cover/coordinator.py
@@ -1661,7 +1661,7 @@
             normal_range = list(map(int, self.normal_list))
             new_range = list(map(int, self.new_list))
         if new_range:
-            state = np.interp(state, normal_range, new_range)
+            state = np.interp(state, new_range, normal_range)
             if state == new_range[0]:
                 state = 0
             if state == new_range[-1]:
