tests/mutation_set/M39_settings_merge_inverted.patch
diff --git a/custom_components/adaptive_cover/__init__.py b/custom_components/adaptive_cover/__init__.py
--- a/custom_components/adaptive_cover/__init__.py
+++ b/custom_components/adaptive_cover/__init__.py
@@ -120,7 +120,7 @@
             update_kwargs["data"] = {**entry.data, "name": new_name}
             update_kwargs["title"] = new_name
         if changes:
-            update_kwargs["options"] = {**entry.options, **changes}
+            update_kwargs["options"] = {**changes, **entry.options}
         hass.config_entries.async_update_entry(entry, **update_kwargs)
         if new_name and not changes:
             # Options updates reload via the update listener; a pure rename
